In [1]:
import pandas
pandas.__version__

'0.24.2'

In [2]:
import numpy as np 
import pandas as pd

In [3]:
dug= pd.Series([10,20,30,40])
dug

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
dug.values

array([10, 20, 30, 40], dtype=int64)

In [5]:
dug.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
judy=pd.Series([20,30,40,50],index=['hi','hello','bye','goodbye'])
judy

hi         20
hello      30
bye        40
goodbye    50
dtype: int64

In [7]:
judy['hi']

20

In [8]:
judy[3]

50

In [9]:
judy.name='bob'
judy.index.name='ssup'
judy

ssup
hi         20
hello      30
bye        40
goodbye    50
Name: bob, dtype: int64

In [10]:
np.log(judy)

ssup
hi         2.995732
hello      3.401197
bye        3.688879
goodbye    3.912023
Name: bob, dtype: float64

In [11]:
judy[judy>20]

ssup
hello      30
bye        40
goodbye    50
Name: bob, dtype: int64

In [12]:
judy_dict={'hi':20,'hello':30,'bye':40,'goodbye':50}
print(judy_dict)
pd.Series(judy_dict)

{'hi': 20, 'hello': 30, 'bye': 40, 'goodbye': 50}

hi         20
hello      30
bye        40
goodbye    50
dtype: int64

In [13]:
text = {"Province": ["FL", "FL", "NH", "NH", "ZH"],
        "Year": [2013, 2014, 2013, 2014, 2014],
        "Literacy": [0.2, 0.1, 0.5, 0.3, 0.5]}
print(text)
dug = pd.DataFrame(text)
dug

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [14]:
df= pd.DataFrame(text,columns=['Year','Literacy','Province'])
df

   Year  Literacy Province
0  2013       0.2       FL
1  2014       0.1       FL
2  2013       0.5       NH
3  2014       0.3       NH
4  2014       0.5       ZH

In [15]:
df['hello']=df.Year/df.Literacy
df

   Year  Literacy Province         hello
0  2013       0.2       FL  10065.000000
1  2014       0.1       FL  20140.000000
2  2013       0.5       NH   4026.000000
3  2014       0.3       NH   6713.333333
4  2014       0.5       ZH   4028.000000

In [16]:
df['stupid'] =pd.Series(range(5))
df

   Year  Literacy Province         hello  stupid
0  2013       0.2       FL  10065.000000       0
1  2014       0.1       FL  20140.000000       1
2  2013       0.5       NH   4026.000000       2
3  2014       0.3       NH   6713.333333       3
4  2014       0.5       ZH   4028.000000       4

In [17]:
df.to_dict()

{'Year': {0: 2013, 1: 2014, 2: 2013, 3: 2014, 4: 2014},
 'Literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.3, 4: 0.5},
 'Province': {0: 'FL', 1: 'FL', 2: 'NH', 3: 'NH', 4: 'ZH'},
 'hello': {0: 10065.0, 1: 20140.0, 2: 4026.0, 3: 6713.333333333334, 4: 4028.0},
 'stupid': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [18]:
pd.DataFrame(df.to_dict())

   Year  Literacy Province         hello  stupid
0  2013       0.2       FL  10065.000000       0
1  2014       0.1       FL  20140.000000       1
2  2013       0.5       NH   4026.000000       2
3  2014       0.3       NH   6713.333333       3
4  2014       0.5       ZH   4028.000000       4

In [19]:
data = [{'a': i, 'b':10* i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [20]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 6}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  6.0

In [21]:
pd.DataFrame(np.random.randint(2, 12),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

   foo  bar
a    6    6
b    6    6
c    6    6

In [22]:
dog = pd.Index([20, 34, 57, 7, 1, 8])
dog

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [23]:
dog[2]

57

In [24]:
dog[::]

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [25]:
print(dog.size, dog.shape, dog.ndim, dog.dtype)

6 (6,) 1 int64

In [26]:
dog[1] = 0

TypeError: Index does not support mutable operations

In [27]:
ing= np.random.RandomState(15)
rng=pd.Series(ing.randint(0,10,3))
rng

0    8
1    5
2    5
dtype: int32

In [28]:
rnf=pd.DataFrame(ing.randint(1,15,(5,4)),columns=['a','b','c','d'])
rnf

    a   b   c   d
0   8   1  13  12
1   8  12   6   7
2  14   2  14   8
3   1  11   5  10
4   8   6   4  13

In [29]:
np.exp(rng)

0    2980.957987
1     148.413159
2     148.413159
dtype: float64

In [30]:
np.sin(rnf * np.pi / 4)

              a             b             c             d
0 -2.449294e-16  7.071068e-01 -7.071068e-01  3.673940e-16
1 -2.449294e-16  3.673940e-16 -1.000000e+00 -7.071068e-01
2 -1.000000e+00  1.000000e+00 -1.000000e+00 -2.449294e-16
3  7.071068e-01  7.071068e-01 -7.071068e-01  1.000000e+00
4 -2.449294e-16 -1.000000e+00  1.224647e-16 -7.071068e-01

In [31]:
air = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='air')
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='pop')
print(air)
pop

Alaska        1723337
Texas          695662
California     423967
Name: air, dtype: int64

California    38332521
Texas         26448193
New York      19651127
Name: pop, dtype: int64

In [32]:
pop/air

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [33]:
air.index|pop.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [34]:
A = pd.Series([1, 4, 6], index=[1, 2, 3])
B = pd.Series([1, 2, 5], index=[2, 3, 4])
print(A)
print(B)
B
A + B

1    1
2    4
3    6
dtype: int64
2    1
3    2
4    5
dtype: int64

1    NaN
2    5.0
3    8.0
4    NaN
dtype: float64

In [35]:
A.add(B, fill_value=0)

1    1.0
2    5.0
3    8.0
4    5.0
dtype: float64

In [36]:
df

   Year  Literacy Province         hello  stupid
0  2013       0.2       FL  10065.000000       0
1  2014       0.1       FL  20140.000000       1
2  2013       0.5       NH   4026.000000       2
3  2014       0.3       NH   6713.333333       3
4  2014       0.5       ZH   4028.000000       4

In [37]:
df2 = pd.DataFrame({"Province": ["FL", "NH", "ZH"], "Population": ["1000", "2000", "3000"]})
df2

  Province Population
0       FL       1000
1       NH       2000
2       ZH       3000

In [38]:
df.merge(df2)

   Year  Literacy Province         hello  stupid Population
0  2013       0.2       FL  10065.000000       0       1000
1  2014       0.1       FL  20140.000000       1       1000
2  2013       0.5       NH   4026.000000       2       2000
3  2014       0.3       NH   6713.333333       3       2000
4  2014       0.5       ZH   4028.000000       4       3000

In [46]:
df2 = pd.DataFrame({"province": ["FL", "NH","ZH"], "Population": ["1000", "2000","3000"]})
df2

  province Population
0       FL       1000
1       NH       2000
2       ZH       3000

In [49]:
df.merge(df2,left_on='Province',right_on='province')

   Year  Literacy Province         hello  stupid province Population
0  2013       0.2       FL  10065.000000       0       FL       1000
1  2014       0.1       FL  20140.000000       1       FL       1000
2  2013       0.5       NH   4026.000000       2       NH       2000
3  2014       0.3       NH   6713.333333       3       NH       2000
4  2014       0.5       ZH   4028.000000       4       ZH       3000

In [50]:
df4 = pd.DataFrame({"Province": ["FL", "NH", "UT"], "Population": ["100000", "200000", "50000"]})
df.merge(df4, how='outer')

     Year  Literacy Province         hello  stupid Population
0  2013.0       0.2       FL  10065.000000     0.0     100000
1  2014.0       0.1       FL  20140.000000     1.0     100000
2  2013.0       0.5       NH   4026.000000     2.0     200000
3  2014.0       0.3       NH   6713.333333     3.0     200000
4  2014.0       0.5       ZH   4028.000000     4.0        NaN
5     NaN       NaN       UT           NaN     NaN      50000

In [53]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, np.nan, np.nan],
                     index=['a', 'b', 'c', 'd', 'e', 'f'])
b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                 index=['a', 'b', 'c', 'd', 'e', 'f'])

In [54]:
a

a    NaN
b    2.5
c    NaN
d    3.5
e    NaN
f    NaN
dtype: float64

In [55]:
b

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    5.0
dtype: float64

In [56]:
pd.Series(np.where(pd.isnull(a), b, a), index=a.index)

a    0.0
b    2.5
c    2.0
d    3.5
e    4.0
f    5.0
dtype: float64

In [57]:
a.combine_first(b)

a    0.0
b    2.5
c    2.0
d    3.5
e    4.0
f    5.0
dtype: float64